# 1. Збережіть наступний текст у змінну і виведіть через функцію print, не втративши ні одинарні, ні подвійні лапки.
# "I'm getting better at this!"

text = str(' "I\'m getting better at this!" ')
print(text)

# 2. Виведіть та порівняйте змінні y та z. Чи можете ви пояснити отриманий результат?
# (одне-два речення чому ми отримали такі значення змінних, та яка з них більше)

y = 87.7e10
z = 87.7e-10
print(y)
print(z)

# в мене були труднощі із розумінням що це за "е" там. я звернувся до чату GPT і він розказав що "е" в Пітоні
# використовується як показник степеня. Тобто 87.7е10 це 87.7*10 в десятій степені.
# відповідно в змінній "z" це 10 в -10 степені
# але чомусь прінт "z" виводить "8.77e-09" а мав би "0.00000000877"
# в будь якому разі змінні "z" менша за змінну "y"

# 3. Чи будуть дві змінні мати однакові значення?

x = "5" + "5"
y = 5 + 5
print(x, y)

# вони мають різні значення, тому що "x" це str (і прінт просто складає разом два п'ятірки як слова),
# а "y" це int (і виконується функція додавання)

# 4. Один із цих об'ктів не схожий на інші. Який і чому?

x = (1, 2, 3)
y = [1, 2, 3]
z = {1, 2, 3}

# "x" та "y" це впорядковані колекції об'єктів (tuple і list відповідно), тоді як "z" це set, що є
# невпорядкованою колекцією



